# St7CreateBeamsOnGeometryEdges

Creates beams on selected geometry edges.

long St7CreateBeamsOnGeometryEdges(long uID, long PropNum, long GeometryAs)

Input Parameters

uID

Strand7 model file ID.

PropNum

Property number of created beams.

GeometryAs

Either geBeam2 or geBeam3.

Dependencies
Selection

Geometry edges can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.